create_clock -name clk -period 2.0 -waveform {0 1.0} [get_ports "clk"]
set_clock_transition -rise 0.1 [get_clocks "clk"]
set_clock_transition -fall 0.1 [get_clocks "clk"]
set_clock_uncertainty 0.05     [get_clocks "clk"]
set_input_delay -max 1.0 -clock [get_clocks "clk"] [get_ports "rst"]
set_input_delay -max 1.0 -clock [get_clocks "clk"] [get_ports "start_pc[*]"]
set_input_delay -min 0.2 -clock [get_clocks "clk"] [get_ports "rst"]
set_input_delay -min 0.2 -clock [get_clocks "clk"] [get_ports "start_pc[*]"]
set_output_delay -max 0.5 -clock [get_clocks "clk"] [get_ports "N_flag"]
set_output_delay -max 0.5 -clock [get_clocks "clk"] [get_ports "Z_flag"]
set_output_delay -max 0.5 -clock [get_clocks "clk"] [get_ports "C_flag"]
set_output_delay -max 0.5 -clock [get_clocks "clk"] [get_ports "V_flag"]
set_output_delay -min 0.0 -clock [get_clocks "clk"] [get_ports "N_flag"]
set_output_delay -min 0.0 -clock [get_clocks "clk"] [get_ports "Z_flag"]
set_output_delay -min 0.0 -clock [get_clocks "clk"] [get_ports "C_flag"]
set_output_delay -min 0.0 -clock [get_clocks "clk"] [get_ports "V_flag"]
set_load 0.05 [get_ports "debug_r0[*]"]
set_load 0.05 [get_ports "debug_r1[*]"]
set_load 0.05 [get_ports "debug_r2[*]"]
set_load 0.05 [get_ports "debug_r3[*]"]
set_load 0.05 [get_ports "debug_r4[*]"]
set_load 0.05 [get_ports "debug_r5[*]"]
set_load 0.05 [get_ports "debug_r6[*]"]
set_load 0.05 [get_ports "debug_r7[*]"]
set_load 0.05 [get_ports "debug_pc[*]"]
set_load 0.05 [get_ports "debug_instr[*]"]
set_load 0.02 [get_ports "N_flag"]
set_load 0.02 [get_ports "Z_flag"]
set_load 0.02 [get_ports "C_flag"]
set_load 0.02 [get_ports "V_flag"]
set_false_path -from [get_ports "rst"]
set_false_path -to [get_ports "debug_r0[*]"]
set_false_path -to [get_ports "debug_r1[*]"]
set_false_path -to [get_ports "debug_r2[*]"]
set_false_path -to [get_ports "debug_r3[*]"]
set_false_path -to [get_ports "debug_r4[*]"]
set_false_path -to [get_ports "debug_r5[*]"]
set_false_path -to [get_ports "debug_r6[*]"]
set_false_path -to [get_ports "debug_r7[*]"]
set_false_path -to [get_ports "debug_pc[*]"]
set_false_path -to [get_ports "debug_instr[*]"]
set_multicycle_path 2 -setup \
    -from [get_pins "div_inst/a[*]"] \
    -to   [get_pins "div_inst/q[*]"]
set_multicycle_path 1 -hold \
    -from [get_pins "div_inst/a[*]"] \
    -to   [get_pins "div_inst/q[*]"]
